intersectPlaneWithLine(Plane!System.Runtime.CompilerServices.IsConst*,GLine!System.Runtime.CompilerServices.IsConst*,System.Boolean,System.Boolean,System.Double*,System.Double*,System.Double*)
Find the 3D intersection point of a plane and a line, ignoring bounds on the plane or line.
Return value:
CS_OVERLAP: line intersects plane in a single point.
CS_DISJOIN: no intersection.
CS_SUBSET:  line lies in plane.
Note: this function is provided for convenience, to avoid having to call
intersectSurfWithCurve with output arrays when we know that there is at most
one intersection point.